<?php

class infinityScript{

	public static $script = array(
		'-1' => array(
			'text' => "你已离开《西财默示录》的世界，要记得回来看橘子学姐哦！",
		),

		'0' => array(
			'text' => "初踏西财校门的你，在寝室卧谈时听到了宿舍11点关门的真相，竟然是有保安深夜巡逻时被丧尸咬掉了头！！！！\n而且西财还有每年一度的“五行血祭”传统，每年都会有人依次惨死于金木水火土五刑之下！\n。。。。。。。。。。。。\n尼玛，既然都已经进了校门，抱怨已经来不及了，想知道那些丧尸从何而来吗，想消灭他们拯救校园，守护心爱的人吗，想破解五行血祭，防止灾厄发生在自己身上吗，跟随橘子学姐一起开始在西财的冒险吧！\n另外在这冒险的时光里，橘子学姐也会慢慢告诉你那淫乱的新生群里发生过怎样的传奇，面瘫唐如何快速攻略冷面凶残的群主，江江是如何从一名青春少女一夜间华丽蜕变为女神，落叶酱受过如何凶残的诅咒，青蛙学姐又发生过怎样的爱恨纠葛。。。跟随橘子学姐，一起去揭开这些谜底吧！\n\n发送“开始”，立刻开始在这个世界的历程；游戏中随时可以发送“退出”来退出游戏。",
			'开始' => 1,
		),

		'1' => array(
			'text' => "“来E301陪橘子学姐自习吧！”\n收到橘子学姐约自习的微信，怎么能不去呢！但是现在刚从东门腐败回来额。。。\n要不要穿过情人坡后的小树林抄近路过去呢？\n\n发送“穿过”或“不穿过”做出你的选择吧！",
			'不穿过' => 2,
			'穿过' => 4,
		),

		'2' => array(
			'text' => "本来就肥，吃撑之后走得好慢。。。\n咦？！橘子学姐已经不在了。。。\n肿么办。。。。。。\n\n发送“橘子学姐我爱你”，用爱召唤回橘子学姐吧！",
			'橘子学姐我爱你' => 3,
		),

		'3' => array(
			'text' => "橘子学姐我回来啦~~~~~\n只听得橘子学姐手边响起“啾啾啾”的声音，时光又回到了刚才！！！！\n\n发送“继续”，继续进行游戏吧",
			'继续' => 1,
		),

		'4' => array(
			'text' => "“啊！蛇！”\n听到前面美女的惊叫，要不要上去英雄救美呢？\n发送“救”或“不救”做出你的选择吧！",
			'救' => 5,
			'不救' => 7,
		),

		'5' => array(
			'text' => "别逗了，你怎么可能斗得过蛇呢。。。。。。\n于是你被一条菜花蛇活活给咬死了。。。\n肿么办，还没陪橘子学姐自习呢。。。。。。\n\n发送“橘子学姐我爱你”，用爱召唤橘子学姐吧！",
			'橘子学姐我爱你' => 6,
		),

		'6' => array(
			'text' => "橘子学姐我回来啦~~~~~\n只听得橘子学姐手边响起“啾啾啾”的声音，时光又回到了刚才！！！！\n\n发送“继续”，继续进行游戏吧",
			'继续' => 4,
		),

		'7' => array(
			'text' => "赶紧后退！\n哎呀，被什么东西给绊倒了。。。\n等下，脚边的那不是死人手吗！\n死人手突然动了起来并且狠狠的抓住你了咆哮道“请留步！其实我是经济学基地班的一名学生，昨天因为强烈的灌入了大量桂花酒导致灵魂跑到了桂花酒里，我的一只手努力挣脱了束缚来到了这里，你愿意帮助我找回自己的灵魂吗！”\n\n请回复“帮助”/“不帮助”做出选择吧！",
			'帮助' => 8,
			'不帮助' => 31,
		),

		'8' => array(
			'text' => "“真是好人呢，可是，我也忘了自己昨天是在哪里喝的酒了，寝室？院办？还是图书馆？难道是情人坡？”\n\n请回复“寝室”/“院办”/“图书馆”/“情人坡”做出选择吧！",
			'寝室' => 9,
			'院办' => 17,
			'图书馆' => 24,
			'情人坡' => 28,
		),

		'9' => array(
			'text' => "咦，这里……？\n“啊！路痴的橘子学姐不小心把你带来了院办！你就将就在这里找一下吧…..”\n轻轻的推开门，发现沙发上居然背对着你坐着一位长发白衣背影美女！是悄悄等待还是假装什么都没看到的走进去呢…….\n\n请回复“悄悄等待”/“走进去”做出选择吧！",
			'悄悄等待' => 10,
			'走进去' => 10,
		),

		'10' => array(
			'text' => "没多久，长发美女发出了一声淡淡的叹息！伴随着叹息声，美女竟然转过了头，“啊正面也是美女啊！！”\n美女看到了你，惊呼了一声，飞快的从你身边跑开了，要不要追上去呢!\n\n请回复“追上去”/“不追”做出选择吧！",
			'追上去' => 11,
			'不追' => 12,
		),

		'11' => array(
			'text' => "“追个屁啊！你是来找桂花酒的！真是见色眼开！卑鄙猥琐下流的无耻败类！”\n被橘子学姐狠狠的骂了一顿。又回到了院办……\n\n请回复“继续找”继续寻找桂花酒吧！",
			'继续找' => 12,
		),

		'12' => array(
			'text' => "“刚刚那个美女是谁呢，和院办或者那个断手或者桂花酒又有什么感情纠葛呢？……”\n打开橱柜，发现了好多像便便一样的豆子！啊，看着好好玩，悄悄的把它拿走吧，咦桌子上居然有四个粽子，三颗咸鸭蛋，两盒奥利奥，七杯奶茶！可是！却没有桂花酒……\n在浓郁的失落感中，你在刚刚那个美女坐着的地方发现了一个密码箱！试试输入密码吧！（英文单词哦）\n【实在想不出来可以向橘子学姐寻求提示或者直接不要脸的找橘子学姐要答案吧……】",
			'hear' => 14,
			'提示' => 13,
		),

		'13' => array(
			'text' => "4327 拼音九键",
			'hear' => 14,
		),

		'14' => array(
			'text' => "没想到居然答对了！\n赶快打开密码箱，里面居然就是一个玻璃瓶，上面写着桂花酒三个大字！\n咦等等，在玻璃瓶下面居然还有一封信！要不要打开看呢！\n\n请回复“打开看”/“不打开”做出选择吧！",
			'打开看' => 15,
			'不打开' => 16,
		),

		'15' => array(
			'text' => "“看个屁啊！你是来找桂花酒的！真是见色眼开！卑鄙猥琐下流的无耻败类！”\n啊……又被橘子学姐狠狠的骂了一顿……\n\n请回复“送回去”把桂花酒送给断手吧！",
			'送回去' => 47,
		),

		'16' => array(
			'text' => "好吧，既然找到了桂花酒，那就给断手送过去吧！\n\n发送“继续”，继续进行游戏吧",
			'继续' => 47,
		),

		'17' => array(
			'text' => "咦，这里明明不像是院办啊？\n“啊！路痴的橘子学姐不小心把你带来了图书馆！你就将就在这里找一下吧…..”——怎么回事，门怎么推不开！\n这个时候，突然蹦了一个诡异的大妈 “小朋友！图书馆岂是你们这些凡人能进的，要想进去，先回答我一个问题吧！\n\n”请回复“迎难而上”/“落荒而逃”做出选择吧！",
			'落荒而逃' => 18,
			'迎难而上' => 19,
		),

		'18' => array(
			'text' => "看样子橘子学姐也被吓到了，拉着你一句话也不说就跑开了……\n接下来换个地方去吧！\n\n请回复“寝室”/“院办”/“图书馆”/“情人坡”做出选择吧！",
			'寝室' => 9,
			'院办' => 17,
			'图书馆' => 24,
			'情人坡' => 28,
		),

		'19' => array(
			'text' => "小朋友听好了！据说古时有一个三岁小童喜观人对弈，日日不息，有一日看着看着脱口而出“这不就是叉叉叉叉吗？”弈者邀其共弈，小童答道需三日之后方可。说完回到家中，悬挂叉叉叉叉于壁，闭门静思。三日后，与人对弈无往不胜。\n\n----请说出这个小故事中，叉叉叉叉指的是什么！\n【实在想不出来可以向橘子学姐寻求提示或者直接不要脸的找橘子学姐要答案吧……】",
			'提示' => 20,
			'河图洛书' => 21,
		),

		'20' => array(
			'text' => "中国古代流传下来的两幅神秘图案，历来被认为是河洛文化的滥觞，阴阳五行术数之源。最早记录在《尚书》之中，其次在《易传》之中，诸子百家多有记述。太极、八卦、周易、六甲、九星、风水、等等皆可追源至此",
			'河图洛书' => 21,
		),

		'21' => array(
			'text' => "“小朋友不错啊！这个都能答上来哈哈哈哈哈哈祝你好运！”\n战战兢兢的进入了图书馆，没想到二楼钢琴椅子上居然背对着你坐着一位长发白衣背影美女！\n是悄悄等待还是假装什么都没看到的走进去呢……. \n\n请回复“悄悄等待”/“走进去”做出选择吧！",
			'悄悄等待' => 10,
			'走进去' => 10,
		),

		'24' => array(
			'text' => "咦，这里明明不像是图书馆啊？\n“啊！路痴的橘子学姐不小心把你带来了情人坡！你就将就在这里找一下吧…..”\n好吧，那就给橘子学姐一点面子象征性的找一找吧……\n咦，情人坡远远的一个角落里居然背对着你坐着一位长发白衣背影美女！\n\n请回复“悄悄等待”/“走过去”做出选择吧！",
			'悄悄等待' => 25,
			'走过去' => 25,
		),

		'25' => array(
			'text' => "没多久，长发美女发出了一声淡淡的叹息！伴随着叹息声，美女竟然转过了头，“啊正面也是美女啊！！”\n美女看到了你，惊呼了一声，飞快的从你身边跑开了，要不要追上去呢!\n\n请回复“追上去”/“不追”做出选择吧！",
			'追上去' => 26,
			'不追' => 27,
		),

		'26' => array(
			'text' => "“追个屁啊！你是来找桂花酒的！真是见色眼开！卑鄙猥琐下流的无耻败类！”\n被橘子学姐狠狠的骂了一顿。又回到了院办……\n\n请回复“继续找”继续寻找桂花酒吧！",
			'继续找' => 27,
		),

		'27' => array(
			'text' => "“刚刚那个美女是谁呢，和情人坡或者那个断手或者桂花酒又有什么感情纠葛呢？……”\n走进草坪深处，发现了好多像豆子一样的便便！\n啊，看着好好玩，悄悄的把它拿走吧，咦另一边居然有四个粽子，三颗咸鸭蛋，两盒奥利奥，七杯奶茶！可是！却没有桂花酒……\n在浓郁的失落感中，你在刚刚那个美女坐着的地方发现了一个密码箱！试试输入密码吧！（英文单词哦）\n【实在想不出来可以向橘子学姐寻求提示或者直接不要脸的找橘子学姐要答案吧……】",
			'hear' => 14,
			'提示' => 13,
		),

		'28' => array(
			'text' => "咦，这里……\n“啊！路痴的橘子学姐不小心把你带来了寝室！”——门怎么推不开！\n这个时候突然冒出来一个带着袖标的阿姨“你的校园卡呢！”\n啊，自己校园卡刷不了这里啊！就说自己是那个断手好了！\n可是，那个断手叫什么名字呢…\n\n请回复“断手的名字”做出回答吧！\n【实在想不出来可以向橘子学姐寻求提示或者直接不要脸的找橘子学姐要答案吧……】",
			'提示' => 29,
			'盈盈' => 30,
		),

		'29' => array(
			'text' => "YY",
			'盈盈' => 30,
		),

		'30' => array(
			'text' => "啊，盈盈啊，怎么又不带饭卡！这样一点安全意识都没有怎么行呢！……”\n被阿姨逮住说了10分钟，你终于上了楼，来到了寝室轻轻推开门，发现椅子上居然背对着你坐着一位长发白衣背影美女！\n\n请回复“悄悄等待”/“走进去”做出选择吧！",
			'悄悄等待' => 10,
			'走进去' => 10,
		),

		'31' => array(
			'text' => "你头也不回的走了，橘子学姐在旁边苦口婆心的劝说“呸！你应该把它羞辱一顿再走的！说不定就是因为卖被子卖插线板什么的被女朋友鄙视了然后一个人借酒消愁导致了这种下场！”\n气氛突然奇怪起来，橘子学姐顿感失礼，回味无穷的说道“算了，你现在还小，等你长大，你就懂了”我们去自习吧！去哪里自习呢？\n\n请回复/“院办”/“图书馆””做出选择吧！",
			'院办' => 42,
			'图书馆' => 32,
		),

		'32' => array(
			'text' => "咦，这里明明不像是图书馆啊？\n“啊对不起路痴的橘子学姐不小心把你带来了院办！你就将就在这里自习一下吧…..”\n轻轻的推开门，发现沙发上居然背对着你坐着一位长发白衣背影美女！\n\n请回复“悄悄等待”/“走进去”做出选择吧！",
			'悄悄等待' => 33,
			'走进去' => 33,
		),

		'33' => array(
			'text' => "没多久，长发美女居然发出了一声淡淡的叹息！伴随着叹息声，美女竟然转过了头，“啊正面也是美女啊！！”\n美女看到了你，惊呼了一声，飞快的从你身边跑开了，要不要追上去呢! \n\n请回复“追上去”/“不追”做出选择吧！",
			'追上去' => 34,
			'不追' => 35,
		),

		'34' => array(
			'text' => "“追个屁啊！你是来自习的！真是见色眼开！卑鄙猥琐下流的无耻败类！”\n被橘子学姐狠狠的骂了一顿。又回到了院办……\n\n请回复“自习”继续自习来赢回橘子学姐芳心吧！",
			'自习' => 35,
		),

		'35' => array(
			'text' => "觉得好饿，于是打开橱柜，发现了好多像便便一样的豆子！啊，看着好好玩，悄悄的把它拿走吧，咦，桌子上有四个粽子，三颗咸鸭蛋，两盒奥利奥，七杯奶茶！可是没有你最爱吃的鲜花饼！\n……突然，你在刚刚那个美女坐着的地方发现了一个密码箱！里面会不会就是鲜花饼呢！试试输入密码吧！（英文单词哦）\n\n【实在想不出来可以向橘子学姐寻求提示或者直接不要脸的找橘子学姐要答案吧……】",
			'hear' => 37,
			'提示' => 36,
		),

		'36' => array(
			'text' => "4327 拼音九键",
			'hear' => 37,
		),

		'37' => array(
			'text' => "没想到居然答对了！\n赶快打开密码箱，里面居然就是一个玻璃瓶，上面写着桂花酒三个大字！\n啊呸！居然不是鲜花饼，咦等等，在玻璃瓶下面居然还有一封信！要不要打开看呢！\n\n请回复“打开看”/“不打开”做出选择吧！",
			'打开看' => 38,
			'不打开' => 39,
		),

		'38' => array(
			'text' => "“看个屁啊！你是来找鲜花饼的！真是见色眼开！卑鄙猥琐下流的无耻败类！”\n啊，又被橘子学姐狠狠的骂了一顿……\n\n请回复“忽略它”来获取橘子学姐的好感继续下一步吧！",
			'忽略它' => 39,
		),

		'39' => array(
			'text' => "咦，桂花酒，桂花酒，怎么很熟悉的样子，这不是那个断手要找的东西吗！要不要给断手送过去呢！请回复“不管他”/“送回去”做出选择吧！",
			'不管他' => 40,
			'送回去' => 41,
		),

		'40' => array(
			'text' => "“你傻的啊！为什么不送过去啊！万一那是个富二代或者卖被子卖了很多钱可以用这个威胁他啊！快去！真是的，你真傻，真的”\n\n听从橘子学姐的话回复“送回去”给断手送回去吧！",
			'送回去' => 47,
		),

		'41' => array(
			'text' => "好吧，既然找到了桂花酒，那就给断手送过去吧！\n\n发送“继续”，继续进行游戏吧",
			'继续' => 47,
		),

		'42' => array(
			'text' => "咦，这里明明不像是院办啊？\n“啊！路痴的橘子学姐不小心把你带来了图书馆！你就将就在这里找一下吧…..”——门怎么推不开！\n这个时候，突然蹦了一个诡异的大妈 “小朋友！图书馆岂是你们这些凡人能进的，要想进去，先回答我一个问题吧！” \n\n请回复“迎难而上”/“落荒而逃”做出选择吧！",
			'落荒而逃' => 43,
			'迎难而上' => 44,
		),

		'43' => array(
			'text' => "看样子橘子学姐也被吓到了，拉着你一句话也不说就跑开了……\n接下来换个地方去吧！\n\n请回复“院办”/“图书馆”做出选择吧！",
			'院办' => 42,
			'图书馆' => 32,
		),

		'44' => array(
			'text' => "小朋友听好了！据说古时有一个三岁小童喜观人对弈，日日不息，有一日看着看着脱口而出“这不就是叉叉叉叉吗？”弈者邀其共弈，小童答道需三日之后方可。说完回到家中，悬挂叉叉叉叉于壁，闭门静思。三日后，与人对弈无往不胜。\n\n----请说出这个小故事中，叉叉叉叉指的是什么！\n【实在想不出来可以向橘子学姐寻求提示或者直接不要脸的找橘子学姐要答案吧……】",
			'提示' => 45,
			'河图洛书' => 46,
		),

		'45' => array(
			'text' => "中国古代流传下来的两幅神秘图案，历来被认为是河洛文化的滥觞，阴阳五行术数之源。最早记录在《尚书》之中，其次在《易传》之中，诸子百家多有记述。太极、八卦、周易、六甲、九星、风水、等等皆可追源至此",
			'河图洛书' => 46,
		),

		'46' => array(
			'text' => "“小朋友不错啊！这个都能答上来哈哈哈哈哈哈祝你好运！”\n战战兢兢的进入了图书馆，没想到二楼钢琴椅子上居然背对着你坐着一位长发白衣背影美女！\n是悄悄等待还是假装什么都没看到的走进去呢……. \n\n请回复“悄悄等待”/“走进去”做出选择吧！",
			'悄悄等待' => 33,
			'走进去' => 33,
		),

		'47' => array(
			'text' => "回到了情人坡，找到了断手，开心把桂花酒和信拿给他，断手拿着桂花酒颤抖了一下。听说还有一封信更是轻轻的抽搐了一下，再发出一声不易察觉的叹息，小声的问了句“她，没有说别的了吗”\n听到这句话，你实在不知道该怎么回答，因为这货就是你靠着猜测把密码弄出来的……跟你毫无关系啊……于是，你也故作深沉的叹了口气。\n\n发送“继续”，继续进行游戏吧",
			'继续' => 48,
		),

		'48' => array(
			'text' => "假装要开口的时候，断手打断了你“我，我懂了，你什么都不用说了，谢谢你”\n他打开了桂花酒，静静等待了一会，对你说“我也没什么好回报你的，这瓶桂花酒，就送给你了吧，如果有什么需要，欢迎随时来找我”\n说完，断手快速的趁着夜色，逃离了你的视线，留下你在坡上喃喃的说“可是亲，你连你的名字都没告诉我，我以后要怎么找你呢”\n\n发送“继续”，继续进行游戏吧",
			'继续' => 49,
		),

		'49' => array(
			'text' => "回头看着橘子学姐，她也深深的叹了口气，“妹的，今天自习都没自习成，还见证了这么恶心的一幕，各回各家吧”\n说完，橘子学姐也趁着夜色快速的离开了你，继续留下你一个人，和一瓶桂花酒，诶……这次，你发出了真正的叹息。\n\n发送“继续”，继续进行游戏吧",
			'继续' => 50,
		),

		'50' => array(
			'text' => "----第一幕结束----\n\n失落的你又不想回寝室，重点是，现在已经超过了11点半，阿姨一定会教训你……\n无处可去的你，漫无目的的走在了通往校医院的路上，突然，在路边看到了一个亮着的小小招牌，写着“遇见”，鬼使神差的，你走了进去\n刚刚踏入这里，你就定在了原地，因为，你看见了！！\n那个长发白衣美女！\n正在吧台！\n静静的调酒！！\n要不要上前搭讪了！你纠结了，迷茫了，紧张了…\n这个时候，你发现橘子学姐也在这里！！快点向橘子学姐寻求帮助吧！",
		),
	);

}