<?php

class infinityScript{

	public static $script = array(
		'-1' => array('text' => "你已离开《西财默示录》的世界，要记得回来看橘子学姐哦！", ),

		'0' => array(
			'text' => "初踏西财校门的你，在寝室卧谈时听到了宿舍11点关门的真相，竟然是有保安深夜巡逻时被丧尸咬掉了头！！！！\n而且西财还有每年一度的“五行血祭”传统，每年都会有人依次惨死于金木水火土五刑之下！\n。。。。。。。。。。。。\n尼玛，既然都已经进了校门，抱怨已经来不及了，想知道那些丧尸从何而来吗，想消灭他们拯救校园，守护心爱的人吗，想破解五行血祭，防止灾厄发生在自己身上吗，跟随橘子学姐一起开始在西财的冒险吧！\n另外在这冒险的时光里，橘子学姐也会慢慢告诉你那淫乱的新生群里发生过怎样的传奇，面瘫唐如何快速攻略冷面凶残的群主，江江是如何从一名青春少女一夜间华丽蜕变为女神，落叶酱受过如何凶残的诅咒，青蛙学姐又发生过怎样的爱恨纠葛。。。跟随橘子学姐，一起去揭开这些谜底吧！\n\n发送“开始”，立刻开始在这个世界的历程；游戏中随时可以发送“退出”来退出游戏。",
			'开始' => 1, ),

		'1' => array(
			'text' => "“来E301陪橘子学姐自习吧！”\n收到橘子学姐约自习的微信，怎么能不去呢！但是现在刚从东门腐败回来额。。。\n要不要穿过情人坡后的小树林抄近路过去呢？\n\n发送“穿过”或“不穿过”做出你的选择吧！",
			'不穿过' => 2,
			'穿过' => 4, ),

		'2' => array(
			'text' => "本来就肥，吃撑之后走得好慢。。。\n咦？！橘子学姐已经不在了。。。\n肿么办。。。。。。\n\n发送“橘子学姐我爱你”，用爱召唤回橘子学姐吧！",
			'橘子学姐我爱你' => 3, ),

		'3' => array(
			'text' => "橘子学姐我回来啦~~~~~\n只听得橘子学姐手边响起“啾啾啾”的声音，时光又回到了刚才！！！！\n\n发送“继续”，继续进行游戏吧",
			'继续' => 1, ),

		'4' => array(
			'text' => "“啊！蛇！”\n听到前面美女的惊叫，要不要上去英雄救美呢？\n发送“救”或“不救”做出你的选择吧！",
			'救' => 5,
			'不救' => 7),

		'5' => array(
			'text' => "别逗了，你怎么可能斗得过蛇呢。。。。。。\n于是你被一条菜花蛇活活给咬死了。。。\n肿么办，还没陪橘子学姐自习呢。。。。。。\n\n发送“橘子学姐我爱你”，用爱召唤橘子学姐吧！",
			'橘子学姐我爱你' => 6, ),

		'6' => array(
			'text' => "橘子学姐我回来啦~~~~~\n只听得橘子学姐手边响起“啾啾啾”的声音，时光又回到了刚才！！！！\n\n发送“继续”，继续进行游戏吧",
			'继续' => 4, ),

		'7' => array(
			'text' => "赶紧后退！\n哎呀，被什么东西给绊倒了。。。\n等下，脚边的那不是死人手吗！！！！！！！！！！！！\n\n同学，今晚你已经玩久啦，快醒醒，回去准备考试啦！明天再来陪橘子学姐玩吧~", ),
	);

}